In [517]:
import pandas as pd
import seaborn as sns

In [518]:
# Plantemos tres hipótesis:
# - Los hombres sufren más ataques de tiburón que las mujeres
# - Los jovenes sufren más ataques que el resto de personas de otras franjas de edad
# - Los tiburones blancos son más letales que otras especies de tiburon

In [519]:
# Nos traemos el data set 
df = pd.read_csv("attacks.csv",encoding = "ISO-8859-1")

In [520]:
# En primer lugar eliminamos todas las filas que en su totalidad contengan valores nulos y las líneas duplicadas.
df = df.dropna(axis=0, how='all')
df.drop_duplicates()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6306,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6308.0,NaN,NaN
6307,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6309.0,NaN,NaN
6308,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6310.0,NaN,NaN
6309,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [521]:
# Ahora eliminamos todas las filas que en la columna Case Number sean "0" y "xx" ya que el resto de los datos son nulos
df = df.drop(df[df["Case Number"] == "0"].index)
df = df.drop(df[df["Case Number"] == "xx"].index)

In [522]:
# Continuamos seleccionando las columnas que pueden ser relevantes para las hipótesis y deshechando las que no
df.drop(["Unnamed: 22", "Unnamed: 23", "Investigator or Source", "original order", "Case Number.2", "Case Number.1", "href", "href formula", "pdf", "Activity", "Location", "Area", "Type", "Time"], axis=1, inplace=True)

In [523]:
df.head()

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
0,2018.06.25,25-Jun-2018,2018.0,USA,Julie Wolfe,F,57,"No injury to occupant, outrigger canoe and pad...",N,White shark
1,2018.06.18,18-Jun-2018,2018.0,USA,Adyson McNeely,F,11,Minor injury to left thigh,N,NaN
2,2018.06.09,09-Jun-2018,2018.0,USA,John Denges,M,48,Injury to left lower leg from surfboard skeg,N,NaN
3,2018.06.08,08-Jun-2018,2018.0,AUSTRALIA,male,M,NaN,Minor injury to lower leg,N,2 m shark
4,2018.06.04,04-Jun-2018,2018.0,MEXICO,Gustavo Ramos,M,NaN,Lacerations to leg & hand shark PROVOKED INCIDENT,N,"Tiger shark, 3m"

In [524]:
# Realizamos un análisis de los valores que se encuentran en la columna "Sex " de cara a facilitar la validación de 
# la primera hipótesis
df["Sex "].unique()

array(['F', 'M', nan, 'M ', 'lli', 'N', '.'], dtype=object)

In [525]:
df[df["Sex "] == "M "]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
563,2014.04.22,22-Apr-2014,2014.0,USA,male,M,42,Laceration & puncture wounds to right foot,N,NaN
1587,2005.05.15,15-May-2005,2005.0,AUSTRALIA,Ben Edelstein,M,NaN,Severe injury to lower leg,N,Blacktip shark

In [526]:
df[df["Sex "] == "lli"]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
1624,2004.11.11.b,11-Nov-2004,2004.0,USA,Brian Kang,lli,38,"Lacerations to hand, knee & thigh",N,5.5 m [18'] white shark

In [527]:
df[df["Sex "] == "N"]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
4938,1934.07.11,11-Jul-1934,1934.0,AUSTRALIA,"18' boat, occupants William & Leslie Newton",N,NaN,No injury to occupants Sharks continually foll...,N,"Blue pointer, 11'"
6131,1801.12.18.R,Reported 18-Dec-1801,1801.0,NaN,Stephen Pettigew,N,NaN,"FATAL, PROVOKED INCIDENT",Y,12' shark

In [528]:
df[df["Sex "] == "."]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
5437,1908.06.02.R,Reported 02-Jun-1908,1908.0,PAPUA NEW GUINEA,NaN,.,NaN,"Remains of 3 humans recovered from shark, but ...",Y,Allegedly a 33-foot shark

In [529]:
# Después de nuestro análisis sustituimos los valores poco comunes, según sean hombre, mujer u otros
df["Sex "] = df["Sex "].replace({"M ":"M", "lli":"M", "N":"Other", ".":"Other"})

In [530]:
df["Sex "].unique()

array(['F', 'M', nan, 'Other'], dtype=object)

In [531]:
# Ya teniendo limpia lo relevante al sexo, procedemos a realizar la limpieza de la columna de la edad

In [532]:
df["Age"].unique()

array(['57', '11', '48', nan, '18', '52', '15', '12', '32', '10', '21',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '19', '25',
       '69', '38', '55', '35', '46', '45', '14', '40s', '28', '20', '24',
       '26', '49', '22', '7', '31', '17', '40', '13', '42', '3', '8',
       '50', '16', '82', '73', '20s', '68', '51', '39', '58', 'Teen',
       '47', '61', '65', '36', '66', '43', '60s', '9', '72', '59', '6',
       '27', '64', '23', '71', '44', '62', '63', '70', '18 months', '53',
       '30s', '50s', 'teen', '77', '74', '28 & 26', '5', '86', '18 or 20',
       '12 or 13', '46 & 34', '28, 23 & 30', 'Teens', '36 & 26',
       '8 or 10', '84', '\xa0 ', ' ', '30 or 36', '6½', '21 & ?', '75',
       '33 or 37', 'mid-30s', '23 & 20', ' 30', '7      &    31', ' 28',
       '20?', "60's", '32 & 30', '16 to 18', '87', '67', 'Elderly',
       'mid-20s', 'Ca. 33', '74 ', '45 ', '21 or 26', '20 ', '>50',
       '18 to 22', 'adult', '9 & 12', '? & 19', '9 months', '25 to 35',
       '23 & 26', '1', '(adult)', '33 & 37', '25 or 28',
       '37, 67, 35, 27,  ? & 27', '21, 34,24 & 35', '30 & 32', '50 & 30',
       '17 & 35', 'X', '"middle-age"', '13 or 18', '34 & 19', '33 & 26',
       '2 to 3 months', 'MAKE LINE GREEN', ' 43', '81', '"young"',
       '7 or 8', '78', '17 & 16', 'F', 'Both 11', '9 or 10', 'young',
       '36 & 23', '  ', 'A.M.', '?    &   14', '10 or 12', '31 or 33',
       '2½', '13 or 14'], dtype=object)

In [533]:
# Observamos los datos y reemplazamos los más evidentes, como pueder teen por 16 años o 20s por 25 años, 
# y donde hay dos datos, la media
df["Age"] = df["Age"].replace({"40s":"45", "20s":"25", "Teen": "16", "60's":"65",
                               "18 months":"2", "30s":"35", "50s":"55","teen":"16", "28 & 26":"27",
                               "18 or 20":"19", "12 or 13":"12", "46 & 34": "40", "28, 23 & 30":"27",
                               "Teens":"16", "36 & 26":"31","8 or 10":"9", "30 or 36":"33", "6½":"7",
                               "21 & ?":"21", "33 or 37":"35","mid-30s":"35", "23 & 20":"21", " 30": "30",
                               "7      &    31": "19", " 28":"28", "20?":"20", "60's":"65", "32 & 30": "31",
                               "16 to 18":"17", "Elderly":"70", "mid-20s":"25", "Ca. 33":"33", "74 ":"74",
                               "45 ":"45", "21 or 26": "24", "20 ":"20", ">50":"60", "18 to 22":"20",
                               "adult":"40","9 & 12":"11", "? & 19":"19", "9 months": "1","25 to 35": "30",
                               "23 & 26":"25","(adult)":"40","33 & 37":"35","25 or 28":"26", "60s":"65",
                               "37, 67, 35, 27,  ? & 27":"35","21, 34,24 & 35":"30","30 & 32":"31",
                               "50 & 30":"40","17 & 35":"26", "middle-age":"40", "13 or 18":"15",
                               "34 & 19":"27", "33 & 26":"30", "2 to 3 months":"1", " 43":"43",
                               '"young"':"20", "7 or 8":"8", "17 & 16":"17", "Both 11":"11", "9 or 10":"10",
                               "young":"20", "36 & 23":"30",'"middle-age"':"40",
                               "?    &   14":"14","10 or 12":"11","31 or 33":"32",
                               "2½":"3","13 or 14":"14"})

In [534]:
df["Age"].unique()

array(['57', '11', '48', nan, '18', '52', '15', '12', '32', '10', '21',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '19', '25',
       '69', '38', '55', '35', '46', '45', '14', '28', '20', '24', '26',
       '49', '22', '7', '31', '17', '40', '13', '42', '3', '8', '50',
       '16', '82', '73', '68', '51', '39', '58', '47', '61', '65', '36',
       '66', '43', '9', '72', '59', '6', '27', '64', '23', '71', '44',
       '62', '63', '70', '2', '53', '77', '74', '5', '86', '84', '\xa0 ',
       ' ', '75', '87', '67', '1', 'X', 'MAKE LINE GREEN', '81', '78',
       'F', '  ', 'A.M.'], dtype=object)

In [535]:
df[df["Age"] == "MAKE LINE GREEN"]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
4390,1953.01.08,08-Jan-1953,1953.0,AUSTRALIA,14-foot boat Sintra,NaN,MAKE LINE GREEN,"No injury to occupant, shark charged boat",N,10' to 12' shark

In [536]:
df[df["Age"] == "\xa0 "]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
1824,2002.09.27.b,27-Sep-2002,2002.0,USA,Jose Diaz,M,,Left thumb lacerated PROVOKED INCIDENT,N,1.8 m [6'] blacktip shark

In [537]:
df[df["Age"] == "X"]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
4052,1959.10.07,07-Oct-1959,1959.0,MOZAMBIQUE,a Portuguese soldier,M,X,"FATAL, died in Lourenco Marques Hospital",Y,NaN

In [538]:
df[df["Age"] == "  "]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
5084,1929.01.27,27-Jan-1929,1929.0,AUSTRALIA,Harry Weatherall,M,,"FATAL, right buttock lacerated, left arm sever...",Y,NaN

In [539]:
df[df["Age"] == "A.M."]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
5170,1925.03.10,10-Mar-1925,1925.0,PAPUA NEW GUINEA,a Papuan,M,A.M.,FATAL,Y,NaN

In [540]:
df[df["Age"] == "F"]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
4676,1943.05.14,14-May-1943,1943.0,AUSTRALIA,unknown,M,F,FATAL,Y,NaN

In [541]:
df[df["Age"] == " "]

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
1825,2002.09.27.a,27-Sep-2002,2002.0,TONGA,Felipe Tonga,M,,Thigh lacerated PROVOKED INCIDENT,N,"Tiger shark, 1.5 m [5']k"
3108,1978.12.29,29-Dec-1978,1978.0,AUSTRALIA,Wayne Brown,M,,Survived,N,NaN

In [542]:
# Observamos que de los restantes sin edad definidad no se puede obtener la información de la edad,
# por lo que copiamos el data set y creamos uno nuevo para poder eliminar estas filas sin afectar al 
# análisis de las otras dos hipótesis
edad = df

In [543]:
edad.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6302 entries, 0 to 6301
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Case Number  6301 non-null   object
 1   Date         6302 non-null   object
 2   Year         6300 non-null   float64
 3   Country      6252 non-null   object
 4   Name         6092 non-null   object
 5   Sex          5737 non-null   object
 6   Age          3471 non-null   object
 7   Injury       6274 non-null   object
 8   Fatal (Y/N)  5763 non-null   object
 9   Species      3464 non-null   object
dtypes: float64(1), object(9)
memory usage: 541.6+ KB

In [544]:
edad = edad.drop(edad[edad["Age"] == " "].index)
edad = edad.drop(edad[edad["Age"] == "F"].index)
edad = edad.drop(edad[edad["Age"] == "A.M."].index)
edad = edad.drop(edad[edad["Age"] == "  "].index)
edad = edad.drop(edad[edad["Age"] == "X"].index)
edad = edad.drop(edad[edad["Age"] == "\xa0 "].index)
edad = edad.drop(edad[edad["Age"] == "MAKE LINE GREEN"].index)

In [545]:
df["Age"].unique()

array(['57', '11', '48', nan, '18', '52', '15', '12', '32', '10', '21',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '19', '25',
       '69', '38', '55', '35', '46', '45', '14', '28', '20', '24', '26',
       '49', '22', '7', '31', '17', '40', '13', '42', '3', '8', '50',
       '16', '82', '73', '68', '51', '39', '58', '47', '61', '65', '36',
       '66', '43', '9', '72', '59', '6', '27', '64', '23', '71', '44',
       '62', '63', '70', '2', '53', '77', '74', '5', '86', '84', '\xa0 ',
       ' ', '75', '87', '67', '1', 'X', 'MAKE LINE GREEN', '81', '78',
       'F', '  ', 'A.M.'], dtype=object)

In [546]:
edad["Age"].unique()

array(['57', '11', '48', nan, '18', '52', '15', '12', '32', '10', '21',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '19', '25',
       '69', '38', '55', '35', '46', '45', '14', '28', '20', '24', '26',
       '49', '22', '7', '31', '17', '40', '13', '42', '3', '8', '50',
       '16', '82', '73', '68', '51', '39', '58', '47', '61', '65', '36',
       '66', '43', '9', '72', '59', '6', '27', '64', '23', '71', '44',
       '62', '63', '70', '2', '53', '77', '74', '5', '86', '84', '75',
       '87', '67', '1', '81', '78'], dtype=object)

In [547]:
# Ahora realizamos la limpieza correspondiente a la tercera hipótesis, la de la mortalidad por tipo de tiburón.
# En primer lugar, creamos un nuevo data set seleccionando los valores que se repiten más de 10 veces.

In [548]:
tibu = df[df.groupby('Species ')["Species "].transform('count')>10]
tibu['Species '].value_counts()

White shark                                           163
Shark involvement prior to death was not confirmed    105
Invalid                                               102
Shark involvement not confirmed                        88
Tiger shark                                            73
Shark involvement prior to death unconfirmed           68
Bull shark                                             52
6' shark                                               40
4' shark                                               40
Questionable incident                                  35
1.8 m [6'] shark                                       35
Questionable                                           34
1.5 m [5'] shark                                       32
1.2 m [4'] shark                                       27
5' shark                                               26
3' shark                                               26
2 m shark                                              25
4' to 5' shark                                         24
3 m [10'] shark                                        22
No shark involvement                                   21
Wobbegong shark                                        21
3' to 4' shark                                         18
3 m shark                                              17
2.4 m [8'] shark                                       16
3.7 m [12'] shark                                      15
Blacktip shark                                         15
12' shark                                              15
1.2 m to 1.5 m [4' to 5'] shark                        14
Blue shark                                             14
Mako shark                                             13
1.5 m shark                                            13
7' shark                                               13
"a small shark"                                        13
Shark involvement prior to death not confirmed         13
5 m [16.5'] white shark                                12
10' shark                                              12
Nurse shark                                            12
6 m [20'] white shark                                  12
Bronze whaler shark                                    12
Raggedtooth shark                                      12
Zambesi shark                                          11
Grey nurse shark                                       11
Name: Species , dtype: int64

In [549]:
# Observamos que los únicos tiburones con más de 50 ataques son el blanco, el tigre y el toro. Sobre estos 3, 
# realizaremos el análisis.

In [550]:
tibu.head()

,Case Number,Date,Year,Country,Name,Sex,Age,Injury,Fatal (Y/N),Species
0,2018.06.25,25-Jun-2018,2018.0,USA,Julie Wolfe,F,57,"No injury to occupant, outrigger canoe and pad...",N,White shark
3,2018.06.08,08-Jun-2018,2018.0,AUSTRALIA,male,M,NaN,Minor injury to lower leg,N,2 m shark
6,2018.06.03.a,03-Jun-2018,2018.0,BRAZIL,Jose Ernesto da Silva,M,18,FATAL,Y,Tiger shark
16,2018.05.09,09-May-2018,2018.0,AUSTRALIA,male,M,NaN,"No injury, surfboard damaged",N,Shark involvement not confirmed
18,2018.04.28.b,28-Apr-2018,2018.0,COSTA RICA,male,M,30,"No injury, shark bit scuba gear",N,Tiger shark

In [513]:
# Creamos un data frame para cada especie de tiburón 
white = tibu[tibu["Species "] == "White shark"]
tiger = tibu[tibu["Species "] == "Tiger shark"]
bull = tibu[tibu["Species "] == "Bull shark"]

In [514]:
# Concatenamos los tres df y elimnamos aquellas líneas donde se desconozca si el ataque fue mortal
tibus = pd.concat([tiger, white, bull])
tibus = tibus[tibus['Fatal (Y/N)'].notna()]
tibus = tibus.drop(tibus[tibus["Fatal (Y/N)"] == "UNKNOWN"].index)

In [515]:
tibus["Species "].unique()

array(['Tiger shark', 'White shark', 'Bull shark'], dtype=object)

In [516]:
edad.to_csv(r'edad.csv', index = False)
df.to_csv(r'sexo.csv', index = False)
tibus.to_csv(r'tibus.csv', index = False)